[
        {
            "name": "Chefpheus",
            "description": "A cute Hackagotchi who is into baking! She can actually only make bread, as we all know from the Great Cake Fire of '19.",
            "kind": {
                "Gotchi": {
                    "base_happiness": 3
                }
            }
        },
        {
            "name": "Gempheus",
            "description": "The boundless, buzzing, crackling energy found in Crystallis manifests itself in Gempheus's personality! That is to say, Gempheus early in the morning is a little more than most people can handle.",
            "kind": {
                "Gotchi": {
                    "base_happiness": 3
                }
            }
        },
        {
            "name": "Hackpheus",
            "description": "Enjoys long hacks on the beach, and thinks that posting her dating profile bio here is somehow not appropriate. You can hear less profanity from this one.",
            "kind": {
                "Gotchi": {
                    "base_happiness": 3
                }
            }
        },
        {
            "name": "Cyl Crystal",
            "description": "Pops, buzzes, and warps the space around it. Soft, warm lights dance within the crystal's facets.",
            "kind": {
                "Keepsake": {}
            }
        },
        {
            "name": "Hacker Spirit",
            "description": "It does not, as a matter of fact, smell like Teen Spirit. Except for when it does. The air is ripe with it whenever new things are being created.",
            "kind": {
                "Keepsake": {}
            }
        },
        {
            "name": "Hacker Egg",
            "description": "If you put your ear up to this egg, you can hear the sounds of a keyboard clacking. And profanity. Lots and lots of profanity...",
            "kind": {
                "Keepsake": {}
            }
        },
        {
            "name": "Bractus Seed",
            "description": "Doughy, yet still somehow prickly. It smells vaguely of yeast, and promises to grow into something in between a fresh loaf of sourdough and a certain tall Sonoran cactus.",
            "kind": {
                "Seed": {
                    "grows_into": "Bractus"
                }
            }
        },
        {
            "name": "Bread Essence",
            "description": "It may be whole wheat, but don't hold that against it. Its rich, freshly-baked aroma triggers overwhelming nostalgia and a gentle, thoughtful sense of calm.",
            "kind": {
                "Keepsake": {}
            }
        },
        {
            "name": "Bread Egg",
            "description": "If you knock gently on this egg, it sounds like the crisp outer shell of hardtack. Petition to change its name to 'Breagg.' No? ... okay fine.",
            "kind": {
                "Keepsake": {}
            }
        },
        {
            "name": "Warp Powder",
            "description": "Sparkling, glittery, glowing blue powder that emits high-pitched squeaking noises, especially when excited. Has been known to accelerate time when suspended in the air.",
            "kind": {
                "Keepsake": {
                    "application_effect": {
                        "TimeIncrease": {
                            "extra_cycles": 1500,
                            "duration_cycles": 12
                        }
                    }
                }
            }
        },
        {
            "name": "Rift Powder",
            "description": "A volatile mixture of two volatile substances! Its powerful time acceleration properties were last recorded in the ancient books of the Brognarks; no one has been able to acquire any of this substance since then.",
            "kind": {
                "Keepsake": {
                    "application_effect": {
                        "TimeIncrease": {
                            "extra_cycles": 15000,
                            "duration_cycles": 12
                        }
                    }
                }
            }
        },
        {
            "name": "Wormhole Powder",
            "description": "The rarest, most pure time acceleration substance in the universe ... so rare, even the ancients only alluded to its existence ... said to be able to call forth the ancient worm of time herself ...",
            "kind": {
                "Keepsake": {
                    "application_effect": {
                        "TimeIncrease": {
                            "extra_cycles": 50000,
                            "duration_cycles": 12
                        }
                    }
                }
            }
        },
        {
            "name": "Rolling Pin",
            "description": "You aren't supposed to have this yet.",
            "kind": {
                "Keepsake": {}
            }
        },
        {
            "name": "Kingpin",
            "description": "You aren't supposed to have this yet.",
            "kind": {
                "Keepsake": {}
            }
        },
        {
            "name": "Coffea Cyl Seed",
            "description": "A special species of coffee bean, descended from Coffea arabica and a host of other species. Instead of beans, this plant is grown for the crystals that gather in clusters on its limbs, inside of which the magical forces of the universe coalesce.",
            "kind": {
                "Seed": {
                    "grows_into": "Coffea Cyl"
                }
            }
        },
        {
            "name": "Cyl Egg",
            "description": "Veins of pure arcane energy course throughout the egg, and holding it quickly makes your hands shaky and numb.",
            "kind": {
                "Keepsake": {}
            }
        },
        {
            "name": "Cyl Wand",
            "description": "You aren't supposed to have this yet.",
            "kind": {
                "Keepsake": {}
            }
        },
        {
            "name": "Cytrus Staff",
            "description": "You aren't supposed to have this yet.",
            "kind": {
                "Keepsake": {}
            }
        },
        {
            "name": "Hacker Vibes Vine Seed",
            "description": "Just holding the sprout in your hands fills you with the desire to make something! Surely, this seed is in for some amazing things.",
            "kind": {
                "Seed": {
                    "grows_into": "Hacker Vibes Vine"
                }
            }
        },
        {
            "name": "Vine Keyboard",
            "description": "You aren't supposed to have this yet.",
            "kind": {
                "Keepsake": {}
            }
        },
        {
            "name": "Jungleboard",
            "description": "You aren't supposed to have this yet.",
            "kind": {
                "Keepsake": {}
            }
        }
    ]
